# Pandas basic

In [1]:
'''

Pandas 基本操作

'''
import pandas as pd

# 宣告一個DataFrame
df = pd.DataFrame(columns = ['Name', 'Age', 'Height'])
df

Empty DataFrame
Columns: [Name, Age, Height]
Index: []

In [2]:
# 插入一個row
df.loc[0] = ['Allen','22','175']
df.loc[1] = ['Jack','25','180']
df.loc[2] = ['Marry','28','170']
df

    Name Age Height
0  Allen  22    175
1   Jack  25    180
2  Marry  28    170

In [3]:
df['Weight'] = ['75','80','60']
df

    Name Age Height Weight
0  Allen  22    175     75
1   Jack  25    180     80
2  Marry  28    170     60

In [4]:
df.drop(['Weight'], axis=1)

    Name Age Height
0  Allen  22    175
1   Jack  25    180
2  Marry  28    170

In [5]:
df

    Name Age Height Weight
0  Allen  22    175     75
1   Jack  25    180     80
2  Marry  28    170     60

In [6]:
df = df.drop(['Weight'], axis=1)
df

    Name Age Height
0  Allen  22    175
1   Jack  25    180
2  Marry  28    170

In [7]:
df.drop(2)

    Name Age Height
0  Allen  22    175
1   Jack  25    180

In [8]:
df

    Name Age Height
0  Allen  22    175
1   Jack  25    180
2  Marry  28    170

In [9]:
df = df.drop(2)
df

    Name Age Height
0  Allen  22    175
1   Jack  25    180

In [10]:
df['Age'][1] = '100'
df

    Name  Age Height
0  Allen   22    175
1   Jack  100    180

In [11]:
df.loc[0] = 'test'
df

   Name   Age Height
0  test  test   test
1  Jack   100    180

In [12]:
df['Height'] = '185'
df

   Name   Age Height
0  test  test    185
1  Jack   100    185

In [13]:
columns = ['Name', 'Age', 'Height']
data = [
    ['Ted','24','177'],
    ['Judy','27','183']
]

new_df = pd.DataFrame(data=data, columns=columns)
new_df

   Name Age Height
0   Ted  24    177
1  Judy  27    183

In [14]:
df = df.append(new_df)
df

   Name   Age Height
0  test  test    185
1  Jack   100    185
0   Ted    24    177
1  Judy    27    183

In [15]:
df.reset_index()

   index  Name   Age Height
0      0  test  test    185
1      1  Jack   100    185
2      0   Ted    24    177
3      1  Judy    27    183

In [16]:
df.reset_index(drop=True)

   Name   Age Height
0  test  test    185
1  Jack   100    185
2   Ted    24    177
3  Judy    27    183

In [17]:
df = df.reset_index(drop=True)
df

   Name   Age Height
0  test  test    185
1  Jack   100    185
2   Ted    24    177
3  Judy    27    183

# DataFrame and Series

In [18]:
df

   Name   Age Height
0  test  test    185
1  Jack   100    185
2   Ted    24    177
3  Judy    27    183

In [19]:
type(df)

pandas.core.frame.DataFrame

In [20]:
df['Name']

0    test
1    Jack
2     Ted
3    Judy
Name: Name, dtype: object

In [21]:
type(df['Name'])

pandas.core.series.Series

In [22]:
pd.Series(data=['Allen', 'Jack', 'Ted', 'Judy'])

0    Allen
1     Jack
2      Ted
3     Judy
dtype: object

In [23]:
pd.Series(data=['Allen', 'Jack', 'Ted', 'Judy'], name='Name')

0    Allen
1     Jack
2      Ted
3     Judy
Name: Name, dtype: object

In [24]:
pd.Series(data=['Allen', 'Jack', 'Ted', 'Judy'], name='Name', index=['emp01', 'emp02', 'emp03', 'emp04'])

emp01    Allen
emp02     Jack
emp03      Ted
emp04     Judy
Name: Name, dtype: object

In [25]:
sName = pd.Series(data=['Allen', 'Jack', 'Ted', 'Judy'], name='Name', index=['emp01', 'emp02', 'emp03', 'emp04'])
sAge = pd.Series(data=['22', '25', '24', '27'], name='Age', index=['emp01', 'emp02', 'emp03', 'emp04'])

In [26]:
pd.DataFrame(data=[sName, sAge])

      emp01 emp02 emp03 emp04
Name  Allen  Jack   Ted  Judy
Age      22    25    24    27

In [27]:
pd.DataFrame(data=[sName, sAge]).T

        Name Age
emp01  Allen  22
emp02   Jack  25
emp03    Ted  24
emp04   Judy  27

# Copy dataframe

In [28]:
df

   Name   Age Height
0  test  test    185
1  Jack   100    185
2   Ted    24    177
3  Judy    27    183

In [29]:
df2 = df
df2

   Name   Age Height
0  test  test    185
1  Jack   100    185
2   Ted    24    177
3  Judy    27    183

In [30]:
df2.loc[1] = 'test'
df2

   Name   Age Height
0  test  test    185
1  test  test   test
2   Ted    24    177
3  Judy    27    183

In [31]:
df

   Name   Age Height
0  test  test    185
1  test  test   test
2   Ted    24    177
3  Judy    27    183

In [32]:
df3 = df.copy()
df3

   Name   Age Height
0  test  test    185
1  test  test   test
2   Ted    24    177
3  Judy    27    183

In [33]:
df3.loc[2] = 'test'
df3

   Name   Age Height
0  test  test    185
1  test  test   test
2  test  test   test
3  Judy    27    183

In [34]:
df

   Name   Age Height
0  test  test    185
1  test  test   test
2   Ted    24    177
3  Judy    27    183

# Save csv

In [35]:
df.to_csv(r'./test_pandas.csv')

In [36]:
# 不儲存 index
df.to_csv(r'./test_pandas.csv', index=0)

In [37]:
df.to_csv(r'./test_pandas.csv', index=0, encoding='utf-8')

In [38]:
# 不儲存欄位
df.to_csv(r'./test_pandas.csv', index=0, encoding='utf-8', header=None)

In [39]:
# 若在 windows 系統中開啟 csv 出現亂碼，可使用 'utf-8-sig' 編碼
df.to_csv(r'./test_pandas.csv', index=0, encoding='utf-8-sig', header=None)

# Load csv

In [40]:
df2 = pd.read_csv(r'./test_pandas.csv')
df2

   test test.1   185
0  test   test  test
1   Ted     24   177
2  Judy     27   183

In [41]:
df2 = pd.read_csv(r'./test_pandas.csv', header=None)
df2

      0     1     2
0  test  test   185
1  test  test  test
2   Ted    24   177
3  Judy    27   183

In [42]:
df2.columns = ['Name', 'Age', 'Height']
df2

   Name   Age Height
0  test  test    185
1  test  test   test
2   Ted    24    177
3  Judy    27    183

In [43]:
df2.to_csv(r'./test_pandas.csv', index=0, encoding='utf-8-sig')
df2 = pd.read_csv(r'./test_pandas.csv')
df2

   Name   Age Height
0  test  test    185
1  test  test   test
2   Ted    24    177
3  Judy    27    183